## 🚀 Terraform Apply Result

| Path | Outcome | Changes |
| :--- | :---: | :--- |
| `environments/test1` | ✅ | +1, -1 |
| `environments/test2` | ✅ | +2 |

<details><summary><strong>Show Output Details</strong></summary>

### 📂 `environments/test1`

```text
module.main.null_resource.main: Refreshing state... [id=5811220108638201812]
random_id.main: Refreshing state... [id=nnD2FdIo37w]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.main.null_resource.default will be created
  + resource "null_resource" "default" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = "9e70f615d228dfbc"
          + "name" = "test1"
        }
    }

  # module.main.null_resource.main will be destroyed
  # (because null_resource.main is not in configuration)
  - resource "null_resource" "main" {
      - id       = "5811220108638201812" -> null
      - triggers = {
          - "id"   = "9e70f615d228dfbc"
          - "name" = "test1"
        } -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
module.main.null_resource.main: Destroying... [id=5811220108638201812]
module.main.null_resource.main: Destruction complete after 0s
module.main.null_resource.default: Creating...
module.main.null_resource.default: Creation complete after 0s [id=883236539871616920]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

Outputs:

result = {}

```

### 📂 `environments/test2`

```text

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.main will be created
  + resource "random_id" "main" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.main.null_resource.default will be created
  + resource "null_resource" "default" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = (known after apply)
          + "name" = "test2"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + result = {}
random_id.main: Creating...
random_id.main: Creation complete after 0s [id=ZzbQYs9AC6g]
module.main.null_resource.default: Creating...
module.main.null_resource.default: Creation complete after 0s [id=4772729057384302945]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

result = {}

```

</details>